[
  {
    "id": "walmart-sec000-part00",
    "content": "Preamble\n\n1 of 16 US Product Quality and Compliance Manual I. Introduction At Walmart and Sam’s Club, we are committed to providing our customers and members with safe and affordable merchandise. This commitment is consistent with our company’s four basic beliefs: • Service to the Customer • Respect for the Individual • Strive for Excellence • Act with Integrity Service to the Customer means we listen to, anticipate, and serve customers’ wants and needs. Respect for the Individual translates to meeting our customers’ expectations; safe and compliant product reflecting the best value. We Strive for Excellence by not simply meeting but exceeding our customers’ expectations. Lastly, we Act with Integrity by working diligently to be the most trusted retailer. As a supplier to Walmart, Inc. (“Walmart”), we expect you to be our partner in delivering products that meet our commitment. One way we do this is by requiring our suppliers to meet all applicable federal, state, and local laws and Walmart-specific requirements for all items offered for sale. Additionally, we expect our private brand suppliers to hold their supply chains to the same rigorous standards to which we hold you. To facilitate you",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 6,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec000-part01",
    "content": "Preamble\n\nAdditionally, we expect our private brand suppliers to hold their supply chains to the same rigorous standards to which we hold you. To facilitate your compliance, this manual was created to provide a consolidated source for Walmart product testing requirements and expectations. Be assured that Walmart will not retaliate against suppliers who, in good faith, raise legal, ethical, or compliance concerns. In fact, failure to report a violation could jeopardize your relationship with Walmart. If you become aware that any of your products violate or fail to meet any regulatory standards or Walmart-specific requirements, you must inform Walmart immediately. You can report violations regarding the product itself by completing a Product Removal Form on Retail Link or by sending an e-mail to GMComply@walmart.com . In addition, suppliers are expected to avoid undue influence or any attempt to persuade, pressure, suggest, or instruct any employee of a third-party laboratory to withhold or change safety or regulatory test results per 16 CFR 1107.24. Violations can be reported through the Walmart Global Ethics website. This manual, and the specific requirements outlined herein, apply to suppli",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 6,
      "char_start": 1050,
      "char_end": 2250
    }
  },
  {
    "id": "walmart-sec000-part02",
    "content": "Preamble\n\n.24. Violations can be reported through the Walmart Global Ethics website. This manual, and the specific requirements outlined herein, apply to suppliers of Walmart Stores and Sam’s Club located in the United States and Puerto Rico only, and to Walmart.com and Samsclub.com. The use of the term “Walmart” in this manual includes Walmart Stores, Sam’s Clubs and all applicable eCommerce entities. The scope of this manual does not include food, dietary supplements, drugs, alcohol, tobacco, or firearms. Walmart does not provide legal advice to suppliers. Suppliers should seek their own legal counsel to ensure compliance with all laws and regulations applicable to their products. 2 of 16 Complete the checklist below for each item you are supplying to Walmart, Walmart.com, Sam’s Club, or Samsclub.com, in order to successfully complete the Testing Program. General Testing Program General Merchandise and Consumables Suppliers for Walmart, Walmart.com, Sam’s Club, and Samsclub.com, check all boxes below Yes N/A Review Testing Process Stakeholders Review General Testing Process Flow Determine your Brand Type, Supplier Designation, Testing Cycle Understand Product Modifications that require new",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 2,
      "total_sub_chunks": 6,
      "char_start": 2100,
      "char_end": 3300
    }
  },
  {
    "id": "walmart-sec000-part03",
    "content": "Preamble\n\ns Review General Testing Process Flow Determine your Brand Type, Supplier Designation, Testing Cycle Understand Product Modifications that require new testing Determine the assigned test lab s for your products. The list of test labs can be found on Retail Link by following the path: • Product Quality and Compliance Library > a1 US Product Quality and Compliance Manual > Third Party Laboratory Assignment Note: S uppliers are required to use the same lab organization for all pre-production, initial production testing and the same lab location for any retesting (previous failures) Complete Test Request Form (TRF) provided by selected Third Party Testing Laboratory Schedule Product Sample Sealing for Direct Import products. Details can be found at: • http://rl.homeoffice.wal- mart.com/rl_docs/adp/ENG/47A2D62538F742A9BEE2CE1D2C44E596.pdf Submit samples to laboratory Note: Laboratory will advise sample submission quantity Obtain passed Pre-Production report. If product failed testing, see Failure Management Program. Obtain passed Production report. If product failed testing, see Failure Management Program. Review Product Removal Guidelines Product Safety & Compliance Program General Mer",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 3,
      "total_sub_chunks": 6,
      "char_start": 3150,
      "char_end": 4350
    }
  },
  {
    "id": "walmart-sec000-part04",
    "content": "Preamble\n\nn report. If product failed testing, see Failure Management Program. Review Product Removal Guidelines Product Safety & Compliance Program General Merchandise and Consumables Suppliers for Walmart, Walmart.com, Sam’s Club, and Samsclub.com, check all boxes below Determine regulatory compliance testing requirements applicable to your product, regardless of market channel (online, store, club, or omni-channel). Product Safety & Compliance Directives & Testing Protocols can be found on Retail Link by following the paths: • Product Quality and Compliance Library > a3 Product Safety and Compliance > Directives • Product Quality and Compliance Library > a3 Product Safety and Compliance > Testing Protocols ) Review Non-Private Brand Testing Program Register with GRS (Global Registration Services) Register with WERCS (Worldwide Environmental & Regulatory Compliance Systems) Review Document Acceptance List (DAL) and provide supporting documentation Supply a Letter of Guarantee (LOG) Walmart Quality Programs General Merchandise and Consumables Suppliers for Walmart. Walmart.com, Sam’s Club, and SamsClub.com check all boxes under your product category • General Merchandise Products Determine",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 4,
      "total_sub_chunks": 6,
      "char_start": 4200,
      "char_end": 5400
    }
  },
  {
    "id": "walmart-sec000-part05",
    "content": "Preamble\n\nSuppliers for Walmart. Walmart.com, Sam’s Club, and SamsClub.com check all boxes under your product category • General Merchandise Products Determine all testing requirements applicable to your product. Contact Approved Third-Party Laboratory Review In-Store Performance Testing program. 3 of 16 Review RIST and SKPPT programs. Provide Bill of Materials/Product Specification for Private Brand item Complete Aesthetic Review and Color Approval Samples ( Appendix A ) • Apparel Products Review the Apparel, Accessories, Footwear and Jewelry Manuals & Tools Folder (Internal Link) • Consumables Products Contact Walmart Consumables Team for testing requirements • Sam’s Club Products Contact Sam’s Club Quality Team for testing requirements",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "Preamble",
      "page_start": 1,
      "page_end": 3,
      "section_index": 0,
      "chunk_type": "section",
      "sub_chunk": 5,
      "total_sub_chunks": 6,
      "char_start": 5250,
      "char_end": 5988
    }
  },
  {
    "id": "walmart-sec001",
    "content": "II. Stakeholders\n\nWalmart Product Safety and Compliance (PSC) This team is responsible for compliance with legislation and regulations. It achieves this through, among other things, establishing and monitoring the testing compliance program and overseeing recalls and product withdrawals. • Walmart US, Walmart.com, Sam’s Club, SamClub.com, and, as directed, applicable subsidiaries • Contact: GMComply@walmart.com Walmart Quality Departments This team is responsible for product performance standards, specifications and performance testing. • Walmart General Merchandise Quality and Technical Team • Contact: gmtechnical@walmart.com Third-Party Laboratories The third-party laboratories perform safety, performance, regulatory and quality testing/verification for products sold by Walmart. Suppliers These companies manufacture and sell products to Walmart. [CONTINUED ON NEXT PAGE] 4 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "II. Stakeholders",
      "page_start": 3,
      "page_end": 4,
      "section_index": 1,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec002",
    "content": "III. General Testing Program Overview\n\n1",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "III. General Testing Program Overview",
      "page_start": 4,
      "page_end": 4,
      "section_index": 2,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec003",
    "content": "A. General Testing Requirements\n\nNote: For Apparel, Footwear, Jewelry and Accessories (Departments 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,) see details in Retail Link by going to: Apps>Product Quality and Compliance Library>a5 Apparel Accessories Footwear Jewelry: Manual and Tools> Performance Testing>PB Omni Approval Process Guide. For All Other GM: See Link Below for Supplier Insurance Requirements (Supplier Liability Insurance Matrix) https://corporate.walmart.com/suppliers/requirements Go to Performance Manual for detailed instruction on specific product Retail Link > Apps > P > Product Quality and Compliance Library",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "A. General Testing Requirements",
      "page_start": 4,
      "page_end": 4,
      "section_index": 3,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec004",
    "content": "B. Brand Types and Supplier Designations\n\n• Non-Private Brand : Brands that are supplier brands or national brands. Suppliers own the product and label, which is well-recognized within the product category, and manage their business domestically with buyer. • Private Brand : Brands exclusive to Walmart, including products labeled as “Marketed or Distributed by Walmart”. • Domestic Import : Supplier is the importer of record. • Direct Import : Walmart is the importer of record. 1 Note: Processes subject to SBU/Department exceptions per GM Quality and Technical Team 5 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "B. Brand Types and Supplier Designations",
      "page_start": 4,
      "page_end": 5,
      "section_index": 4,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec005-part00",
    "content": "C. Testing Cycles\n\n• Material Adoption Process (MAP) – Apparel and Soft Home Only (not applicable to Online Exclusive items) o Ensures fabric being used by suppliers performs to Walmart quality specifications. o Follows the below process: • Color/Aesthetic approval – GM private branded items only Process by which Walmart Product Development will approve a submitted physical swatch of production material. • Initial – First time item is to be sold by Walmart • Pre-production (optional for Online Exclusive items) – Submitted samples should be constructed in the same manner as production samples and submitted as far ahead of production as possible to ensure any problems identified can be corrected before production begins. Packaging/labeling is optional. • Production – Samples must be taken from actual production lots and be representative of what will be sold in all retail formats. Packaging/labeling is required. Direct Import production submissions are required to be sample sealed by a third party. Note: Pre-production and production samples must be submitted separately for each factory and any new factory that may be contracted for item production. 6 of 16 • Annual – This is designed for goods that wi",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "C. Testing Cycles",
      "page_start": 5,
      "page_end": 6,
      "section_index": 5,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 2,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec005-part01",
    "content": "C. Testing Cycles\n\ntted separately for each factory and any new factory that may be contracted for item production. 6 of 16 • Annual – This is designed for goods that will be sold by Walmart for more than one year. Both Product Safety & Compliance and Performance requirements are to be tested on an annual basis for as long as the item is sold by Walmart. • Final Inspection – Once a PO is 100% produced and packed, a final inspection is performed by supplier or 3 rd party. • In-store/Quality Monitoring Program (QMP) – Product is procured from retail store level and tested for performance and quality requirements at designated third party laboratories. Product Safety & Compliance requirements are typically not included in these tests, although they may be at the discretion of PSC.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "C. Testing Cycles",
      "page_start": 5,
      "page_end": 6,
      "section_index": 5,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 2,
      "char_start": 1050,
      "char_end": 1819
    }
  },
  {
    "id": "walmart-sec006-part00",
    "content": "D. Product Modifications\n\n• Material/factory change : Any time an item undergoes a material or factory change, the item must be submitted for full testing. • UPC change: If a product or product package is altered due to any of the following reasons, a new UPC number MUST be assigned to the altered product: • Regulatory change • Law (enacted or pending) • Standard enactment or revision (i.e. ANSI, ASTM, UL, Walmart US Compliance Requirement, etc.) • Ruling or clarification of a ruling from any governing body (i.e. CPSC, FTC, FDA, etc.) • Packaging – Change in product size or package statement of size affecting how product would be regulated (i.e. adding 20% more product to the container of a product that has regulated size limit in some areas) • Design change • Changes made due to patent or trademark infringement or alleged infringement • Formulation changes, change of color or core composition of a product • Material changes, including the sourcing of component parts • Proactive changes to product due to a safety issue • Product Removals • All products that have been subjected to a safety recall or withdrawal must have a new UPC assigned regardless of if the removal was for specific date codes or lot number",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "D. Product Modifications",
      "page_start": 6,
      "page_end": 7,
      "section_index": 6,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 2,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec006-part01",
    "content": "D. Product Modifications\n\nve been subjected to a safety recall or withdrawal must have a new UPC assigned regardless of if the removal was for specific date codes or lot numbers. • Changes because competitor’s similar product has been recalled and your product has the same feature or component. • Additional – • Adding or removing marks obtained through certifying bodies (i.e. Juvenile Products Manufacturers Association Certification [JPMA], Carpet and Rug Institute Seal of Approval [CRI], etc.) • Addition to a product (i.e. gift with purchase, bonus item, or any time an item is added that would be held to different laws or standards than the original product) 7 of 16 • Packaging change : If product packaging, but not the product, is substantially altered, only the package must be submitted for retesting.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "D. Product Modifications",
      "page_start": 6,
      "page_end": 7,
      "section_index": 6,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 2,
      "char_start": 1050,
      "char_end": 1839
    }
  },
  {
    "id": "walmart-sec007",
    "content": "E. Sample Submission\n\nPlease contact the test labs directly for the quantity of samples required. The test labs will not test until all required samples are received. Suppliers may see savings through grouping of items. Items with the same fit, form, and function that were manufactured in the same factory may in some cases be grouped or consolidated for testing. Most suitable differences are either size or color of the product. Please contact the test lab for information on consolidation of samples. Items grouped together during Pre-Production and Production Testing will also be grouped during In-Store testing. NOTE: Samples must be submitted at the same time, in a “group”. Labs will not hold items that are sent in separately.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "E. Sample Submission",
      "page_start": 7,
      "page_end": 7,
      "section_index": 7,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec008-part00",
    "content": "F. Failure Management Program\n\nIf a sample fails to meet requirements at any phase of testing/verification, the supplier is responsible for correcting the deficiency or non-conformity and submitting a corrected sample for retesting/verification with the completed Corrective Action Plan (CAP) form provided by the third-party laboratory (see below). The CAP must be approved before submitting the corrected product for retest. The table located on next page identifies the required source of CAP approval based on the sourcing of the product: [CONTINUED ON NEXT PAGE] 8 of 16 Corrective Action Plan 1.0 Reference Test Report # Supplier Apparel, Textile, Footwear & Jewelry Required, Others Recommended Test Type Factory HVN COO Department Retail Market Factory ID Order Type Style/Vendor Stk# Brand Name Mil Retail Price Item Description Fine Line Buyer 2.0 Failure Points {add lines as needed} 2.1 2.2 2.3 3.0 Root Cause Analysis {add lines as needed} 3.1 3.2 3.3 4.0 List PO# and Quantity Ordered/Produced/Affected{add lines as needed} PO# Quantity Ordered Quantity Produced Quantity Affected/Quarantined Total PO Qty Units Produced 5.0 Inventory Status {add lines as needed} In-Store Date Units Shipped Units in Supplier Warehou",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Failure Management Program",
      "page_start": 7,
      "page_end": 10,
      "section_index": 8,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 4,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec008-part01",
    "content": "F. Failure Management Program\n\ntity Affected/Quarantined Total PO Qty Units Produced 5.0 Inventory Status {add lines as needed} In-Store Date Units Shipped Units in Supplier Warehouse Units in Walmart Warehouse Units Sold # of Stores Shipped Average Units per Store Current Sell-through % Total Return Rate Defective Return Rates Voice of the Customer: Star Rating 6.0 Disposition of Affected Quantity {add lines as needed} 6.1 6.2 6.3 7.0 Styles/Vendor Stk #'s using affected Raw Materials {add lines as needed} 7.1 8.0 Corrective and Preventative Action {add lines as needed} 8.1 8.2 8.3 9.0 Pictorial Evidences {add lines as needed} Before After Before After 10.0 Product Get Well Date And Tracking Information: {Date that WIP & Instore product is expected to meet 100% Walmart requirements} 11.0 Acknowledgment As a duly authorized representative, I confirm that my company has diligently followed and properly executed the corrective action plan as mentioned above. We will be duly liable for any non-compliance observed by Walmart Stores, Inc. at any time. Authorized Signature: Date: Printed Name: Title: Email: Phone# Additional contacts: (name, title & email) Go to Retail Link > Apps > P > Product Quality and Compliance",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Failure Management Program",
      "page_start": 7,
      "page_end": 10,
      "section_index": 8,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 4,
      "char_start": 1050,
      "char_end": 2250
    }
  },
  {
    "id": "walmart-sec008-part02",
    "content": "F. Failure Management Program\n\nre: Date: Printed Name: Title: Email: Phone# Additional contacts: (name, title & email) Go to Retail Link > Apps > P > Product Quality and Compliance Library>CAP form 9 of 16 CAP Handling Matrices Private Brand Performance/Quality Failure Regulatory/ Compliance Failure Order Type Initiates System Communication Requesting CAP Test Fail #1 Disposition for Retest Test Fail #2+ Disposition MAP / Component Testing* Direct Import 3rd Party Lab 3rd Party Lab Offshore MQE/QA - - Domestic 3rd Party Lab 3rd Party Lab Onshore Tech/QA - - Pre-production* Direct Import 3rd Party Lab 3rd Party Lab Offshore MQE/QA - - Domestic 3rd Party Lab 3rd Party Lab Onshore Tech/QA - - Production Testing (Initial Direct Import 3rd Party Lab Offshore MQE/QA Onshore Tech/QA 3rd Party Lab and Annual) Domestic 3rd Party Lab Onshore Tech/QA Onshore Tech/QA 3rd Party Lab In-Store* Direct Import 3rd Party Lab Onshore Tech/QA Onshore Tech/QA - - Domestic 3rd Party Lab Onshore Tech/QA Onshore Tech/QA - - * NOTE: Online Exclusive items are not required to have MAP, Pre-production, or In-Store testing; they are optional. Non-Private Performance/Quality Failure Regulatory/ Compliance Failure Brand Order Type Initiates S",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Failure Management Program",
      "page_start": 7,
      "page_end": 10,
      "section_index": 8,
      "chunk_type": "section",
      "sub_chunk": 2,
      "total_sub_chunks": 4,
      "char_start": 2100,
      "char_end": 3300
    }
  },
  {
    "id": "walmart-sec008-part03",
    "content": "F. Failure Management Program\n\nroduction, or In-Store testing; they are optional. Non-Private Performance/Quality Failure Regulatory/ Compliance Failure Brand Order Type Initiates System Communication Requesting CAP Test Fail #1 Disposition for Retest Test Fail #2+ Disposition MAP / Component Testing** Direct Import 3rd Party Lab - - - - - - Domestic 3rd Party Lab - - - - - - Pre-production** Direct Import 3rd Party Lab - - - - - - Domestic 3rd Party Lab - - - - - - Production Testing (Initial and Annual) Direct Import 3rd Party Lab Onshore Tech/QA Onshore Tech/QA 3rd Party Lab Domestic 3rd Party Lab Onshore Tech/QA Onshore Tech/QA 3rd Party Lab In-Store Direct Import 3rd Party Lab Onshore Tech/QA Onshore Tech/QA - - Domestic 3rd Party Lab Onshore Tech/QA Onshore Tech/QA - - ** NOTE: Non-Private Brand items are not required to have MAP or Pre-production testing; they are optional. Retest due to failure: The retest sample must be submitted within 3 months of the failed report. 10 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Failure Management Program",
      "page_start": 7,
      "page_end": 10,
      "section_index": 8,
      "chunk_type": "section",
      "sub_chunk": 3,
      "total_sub_chunks": 4,
      "char_start": 3150,
      "char_end": 4118
    }
  },
  {
    "id": "walmart-sec009",
    "content": "G. Product Removal\n\nOccasionally, a product is identified that does not meet regulatory, legal, or quality requirements. When this occurs, Walmart removes the item from stores, clubs, distribution centers (DC), and online through a multi-team process initiated by the Retail Link Product Removal process. For more information, please reference the guide found on Retail Link by following the path below: Retail Link->Docs->Product Removal Supplier Process Guide->Product Removal Help Domestic suppliers are also obligated to register with the Consumer Product Safety Information Database, www.saferproducts.gov , to ensure that reports of harm submitted by consumers regarding any of their products are received.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "G. Product Removal",
      "page_start": 10,
      "page_end": 10,
      "section_index": 9,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec010",
    "content": "IV. Product Safety & Compliance Program (Including Walmart and Sam’s Club)\n\nThe information in this section relates only to requirements deemed regulatory in nature by Walmart Stores Inc. and are managed by the Walmart Product Safety and Compliance team. Subsequent sections provide information related to quality requirements.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "IV. Product Safety & Compliance Program (Including Walmart and Sam’s Club)",
      "page_start": 10,
      "page_end": 10,
      "section_index": 10,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec011-part00",
    "content": "A. Non-Private Brand Product Testing/Verification Program:\n\nNon-Private brand products may be subject to product safety and compliance requirements by multiple retailers. To minimize duplicative testing, suppliers of domestically sourced non-private brand products may submit samples with a passing third-party test report to their Walmart assigned lab in lieu of testing/verification for regulatory requirements not listed on the Document Acceptance List, using the following guidelines:  The test report must be dated within the past twelve months and issued by a CPSC accepted lab ( https://www.cpsc.gov/cgi-bin/labsearch/ )  The test report must reflect testing/verification for the exact product sold to Walmart.  The test report must include the date, item identification; testing/verification performed and designated passing result for the applicable requirement(s). The Walmart assigned third-party laboratory will review the test report against the product testing/verification protocols and will test only to those requirements not covered by the submitted test report. This program cannot be utilized to satisfy Walmart Stores or Sam’s Club quality testing program requirements and is not an option for private brand or direct import products. 1",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "A. Non-Private Brand Product Testing/Verification Program:",
      "page_start": 10,
      "page_end": 11,
      "section_index": 11,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 2,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec011-part01",
    "content": "A. Non-Private Brand Product Testing/Verification Program:\n\nlized to satisfy Walmart Stores or Sam’s Club quality testing program requirements and is not an option for private brand or direct import products. 11 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "A. Non-Private Brand Product Testing/Verification Program:",
      "page_start": 10,
      "page_end": 11,
      "section_index": 11,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 2,
      "char_start": 1050,
      "char_end": 1207
    }
  },
  {
    "id": "walmart-sec012",
    "content": "B. Global Registration Services (GRS)\n\nWalmart uses the Vendor Watch program through GRS to verify and monitor the compliance status of registered licenses. Suppliers selling any type of product that is stuffed or upholstered must create an account with GRS and subscribe to the Vendor Certification service in order to register the necessary state licenses for their stuffed and/or upholstered articles. The GRS website and all relevant information can be accessed at the following link: http://www.globalrsinc.com .",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "B. Global Registration Services (GRS)",
      "page_start": 11,
      "page_end": 11,
      "section_index": 12,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec013",
    "content": "C. Worldwide Environmental & Regulatory Compliance Systems (WERCS)\n\nFor products that contain any type of chemical, aerosol, or pesticide, and for products that contain batteries with lithium or lead , suppliers are required to complete the Chemical Assessment Review Process by submitting formulation information to the WERCS. Access the following site for additional information: https://secure.supplierwercs.com/ or call WERCS directly at (518)720-6220.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "C. Worldwide Environmental & Regulatory Compliance Systems (WERCS)",
      "page_start": 11,
      "page_end": 11,
      "section_index": 13,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec014",
    "content": "D. Consumer Product Safety Commission (CPSC) Regulatory Robot\n\nThe Consumer Product Safety Commission (CPSC)’s Regulatory Robot is an online tool which can help suppliers determine what US safety requirements apply to specific consumer products. The Robot uses input provided by the individual user to identify important product safety requirements which should be reviewed before manufacturing or importing consumer product. The Robot is not intended as legal advice, nor does it replace or supersede a manufacturer’s obligations to comply with all applicable CPSC requirements. Be aware this link may not include requirements which Walmart Inc. has chosen to adopt and are reflected in the protocols and directives which can be accessed through Retail Link. The CPSC Robot is available at https://business.cpsc.gov . The Robot is mobile-friendly and available in English and Chinese, and partially available in Spanish, Vietnamese, and Indonesian.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "D. Consumer Product Safety Commission (CPSC) Regulatory Robot",
      "page_start": 11,
      "page_end": 11,
      "section_index": 14,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec015",
    "content": "E. Document Acceptance List\n\nThe Document Acceptance List (DAL) can be found on Retail ink at the following path: • Product Quality and Compliance Library > a3 Product Safety and Compliance > Document Acceptance List The DAL outlines when prior third-party test reports or documentation can be accepted by the Walmart-assigned third-party laboratories in lieu of conducting physical and/or chemical tests. PSC reserves the right to require testing for products where documents have been submitted in lieu of testing. 12 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "E. Document Acceptance List",
      "page_start": 11,
      "page_end": 12,
      "section_index": 15,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 1
    }
  },
  {
    "id": "walmart-sec016-part00",
    "content": "F. Letters of Guarantee (LOG)\n\n1. Using LOG for an Entire Item Letters of Guarantee can be applied in conjunction with the Document Acceptance List in the following situation(s) to cover testing for an entire item: 1. Sourcing Change – Product was previously carried as direct import and is being switched to domestic or vice versa. This does not apply to a change in factory. 2. Retail Format Change – Product is carried in Walmart under one UPC and/or item number, and it is now being added to Dotcom under another or vice versa (also applicable to products changing departments). 3. Discontinued Item – Product has been fully produced but discontinued; there is residual inventory for sale; and the residual inventory is representative (i.e., produced at the same time, in the same factory, and using the same materials) of the product tested under the last production report, regardless of expiration date of the report. 4. Supplier Name Change – Product was tested under the previous supplier name, and the supplier has undergone a name change before the production test expires. If the production test has expired, product requires testing under the new supplier name. 5. Bundle / Assortment – Product is a bundle / assortmen",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Letters of Guarantee (LOG)",
      "page_start": 12,
      "page_end": 15,
      "section_index": 16,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 5,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec016-part01",
    "content": "F. Letters of Guarantee (LOG)\n\nes. If the production test has expired, product requires testing under the new supplier name. 5. Bundle / Assortment – Product is a bundle / assortment under a single UPC and made up of products under various UPCs which have current production test reports or vice versa (e.g., dinnerware set under one UPC and individual dinnerware pieces under various UPCs). 13 of 16 *Please refer to the LOG General Requirements for information on what must be certified. The lab may conduct a gap analysis to determine if there are any testing gaps and test for the gaps. 2. Using LOG for Part of an Item Letters of Guarantee can be applied in conjunction with the Document Acceptance List in the following situation(s) to cover testing for part of an item: 1. Bulk Material – Product is composed of a material that has undergone bulk material testing (e.g., plush in comforter). 2. Component – Product is composed of a component that has undergone component testing (e.g., mechanical motor in blender, wheels on toy vehicles, doll hair, beads of the same color in activity kits). Yes No Yes No Yes Yes No No Is the item a bundle or assortment? Are the production test reports for each UPC making up the bundle /",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Letters of Guarantee (LOG)",
      "page_start": 12,
      "page_end": 15,
      "section_index": 16,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 5,
      "char_start": 1050,
      "char_end": 2250
    }
  },
  {
    "id": "walmart-sec016-part02",
    "content": "F. Letters of Guarantee (LOG)\n\nin activity kits). Yes No Yes No Yes Yes No No Is the item a bundle or assortment? Are the production test reports for each UPC making up the bundle / assortment less than one year old? Is the item a discontinued product? Has there been a change in sourcing, retail format, or supplier name? The previous production test report is more than one year old. The previous production test report is less than one year old. I want to use a LOG to cover testing for an entire item. LOG will not be accepted. Product must be submitted for testing. LOG may be accepted. * LOG may be accepted. * LOG will not be accepted. Product must be submitted for testing. 14 of 16 LOG may be accepted. * Yes No Yes * Please refer to the LOG General Requirements for information on what must be certified. The lab may conduct a gap analysis to determine if there are any testing gaps and test for the gaps. 3. General Requirements Letters of Guarantee must include the following: 1. Drafted on supplier’s company letterhead or include an e-verification of the origin of the LOG 2. Date 3. Product name, UPC, item number and description 4. Original test report number and test date, if applicable 5. Statement of guarantee",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Letters of Guarantee (LOG)",
      "page_start": 12,
      "page_end": 15,
      "section_index": 16,
      "chunk_type": "section",
      "sub_chunk": 2,
      "total_sub_chunks": 5,
      "char_start": 2100,
      "char_end": 3300
    }
  },
  {
    "id": "walmart-sec016-part03",
    "content": "F. Letters of Guarantee (LOG)\n\ne LOG 2. Date 3. Product name, UPC, item number and description 4. Original test report number and test date, if applicable 5. Statement of guarantee certifying that the original test report provided applies to the product being shipped to Walmart, if applicable 6. Statement of guarantee certifying that the product is representative (i.e., produced at the same time, in the same factory, and using the same materials) of the product tested in the production report, if applicable 7. For products requiring a tracking method (e.g. children’s products, wood products, etc.), indicate how the product can be linked to the test report (e.g. tracking label, lot code, etc.) 8. Signature of an officer of the company o For the purpose of letters of guarantee, an officer is a high-level management official with authority to act on behalf of the company 9. If applicable, a copy of the test report must be attached showing that: o Product was tested by a Walmart approved test laboratory and meets the Walmart testing/verification requirements, AND o Test report meets the Walmart product testing/verification program time frame I want to use a LOG to cover testing for part of an item. Does the item par",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Letters of Guarantee (LOG)",
      "page_start": 12,
      "page_end": 15,
      "section_index": 16,
      "chunk_type": "section",
      "sub_chunk": 3,
      "total_sub_chunks": 5,
      "char_start": 3150,
      "char_end": 4350
    }
  },
  {
    "id": "walmart-sec016-part04",
    "content": "F. Letters of Guarantee (LOG)\n\nt report meets the Walmart product testing/verification program time frame I want to use a LOG to cover testing for part of an item. Does the item part have a production test report for bulk material or component testing? LOG will not be accepted. Product must be submitted for testing. 15 of 16",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "F. Letters of Guarantee (LOG)",
      "page_start": 12,
      "page_end": 15,
      "section_index": 16,
      "chunk_type": "section",
      "sub_chunk": 4,
      "total_sub_chunks": 5,
      "char_start": 4200,
      "char_end": 4495
    }
  },
  {
    "id": "walmart-sec017-part00",
    "content": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s\n\nClub and Online Exclusive Items) A. General Merchandise Testing 1. In-Store Performance Testing For the General Merchandise (Non-Apparel) items “initial In-Store Quality Audit”, all sizes and colorways representative of each style will be randomly pulled for testing as soon as the products are available in stores. Full testing will be conducted including color match testing. It is the supplier’s responsibility to inform Walmart at gmtechnical@wal-mart.com of any items that have been discontinued and should be removed from the In-Store testing program. Walmart Private Brand and Non-Private items require In-Store testing according to the chart on page 4, unless otherwise specified by Walmart Additional In-Store goods may be tested when the “initial In-Store Quality Audit” results in a test failure. High Sampling Retest from multiple regions for Major or Minor failures will be at the direction of the Walmart Quality and Technical Team. 2. In-Store High Volume Sampling (HVS-Larger Local/Regional Pulls) When an in-store test fails and there is reason to believe that the failure is widespread, a larger local or regional pull can be initiated across 5 regions of the country. The results d",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s",
      "page_start": 15,
      "page_end": 16,
      "section_index": 17,
      "chunk_type": "section",
      "sub_chunk": 0,
      "total_sub_chunks": 4,
      "char_start": 0,
      "char_end": 1200
    }
  },
  {
    "id": "walmart-sec017-part01",
    "content": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s\n\ne is reason to believe that the failure is widespread, a larger local or regional pull can be initiated across 5 regions of the country. The results determine the extent of the failure and possible courses of action. The total number of samples for HVS will be based on ANSI/ASQ Z1.4 Special Inspection Level S-4 Order Size Sample Size Number of major and critical defects- Accept/Reject Up to 10,000 pieces 32 pieces 2/3 10,001 to 35,000 pieces 50 pieces ¾ 35,001 to 500,000 pieces 80 pieces 5/6 500,001 and up 125 pieces 7/8 3. Reduced In-Store Testing (RIST) and Skip Pre-Production Testing (SKPPT) Walmart rewards “Best in Class” suppliers for consistently providing quality products in our Private Label Brands with a reduction in the frequency of In-Store testing from quarterly to annually. The criteria for reduced In-Store testing are based on Walmart business requirements and supplier quality performance in the following areas: • Product Withdrawals and Recalls • Return Rate (RR) • In-Store Testing 16 of 16 To be considered for participation, suppliers must meet the following requirements: • Business requirements for product category align with In-Store testing reduction program • No",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s",
      "page_start": 15,
      "page_end": 16,
      "section_index": 17,
      "chunk_type": "section",
      "sub_chunk": 1,
      "total_sub_chunks": 4,
      "char_start": 1050,
      "char_end": 2250
    }
  },
  {
    "id": "walmart-sec017-part02",
    "content": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s\n\nation, suppliers must meet the following requirements: • Business requirements for product category align with In-Store testing reduction program • No product withdrawals or recalls in the past fiscal year • Return Rate (RR) compared to the category average • In-Store Testing Fail Rate compared to the category average Eligibility assessments will be conducted annually. New and continued participation in the In-Store testing reduction program will be based on supplier product quality performance for the previous year. Note: Suppliers will be immediately dropped from the In-Store testing reduction program for any product withdrawal or recall. Suppliers will be notified if they are eligible to participate in the program. Suppliers approved for RIST are automatically approved for SKPPT. With the Skip Pre-Production Testing Program (SKPPT), Walmart Private Brand suppliers have the option to skip the Pre-Production testing portion of the Walmart General Merchandise Approval and Testing Process in the eligible category. If suppliers “opt-in” to SKPPT, they are not required to perform Pre-Production testing. (Samples for PD/Buyer aesthetic review may still be requested). SKPPT allows suppl",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s",
      "page_start": 15,
      "page_end": 16,
      "section_index": 17,
      "chunk_type": "section",
      "sub_chunk": 2,
      "total_sub_chunks": 4,
      "char_start": 2100,
      "char_end": 3300
    }
  },
  {
    "id": "walmart-sec017-part03",
    "content": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s\n\nto SKPPT, they are not required to perform Pre-Production testing. (Samples for PD/Buyer aesthetic review may still be requested). SKPPT allows suppliers to go directly to Production testing. It is highly recommended that suppliers still elect to take advantage of Pre-Production or Vendor Only Testing to Walmart requirements in order to prevent potential shipment delays or PO cancellations due to a failed Production test. Suppliers must complete the SKPPT Form with Instructions and submit it along with the Production test request form and samples.",
    "metadata": {
      "source": "u-s-product-quality-and-compliance-manual.pdf",
      "section_header": "V. Walmart US Quality Programs (Excluding Consumables, Health & Wellness, Sam’s",
      "page_start": 15,
      "page_end": 16,
      "section_index": 17,
      "chunk_type": "section",
      "sub_chunk": 3,
      "total_sub_chunks": 4,
      "char_start": 3150,
      "char_end": 3704
    }
  }
]